{
  "1/8": {
    "3019": "The Company reach Hollin."
  },
  "1/11": {
    "3019": "Snow on Caradhras."
  },
  "1/12": {
    "3019": "Snow on Caradhras."
  },
  "1/13": {
    "3019": "Attack by Wolves in the early hours. The Company reaches the West-gate of Moria at nightfall. Gollum begins to trail the Ring-bearer."
  },
  "1/14": {
    "3019": "Night in Hall Twenty-one."
  },
  "1/15": {
    "3019": "The Bridge of Khazad-dûm, and fall of Gandalf. The Company reaches Nimrodel late at night."
  },
  "1/17": {
    "3019": "The Company comes to Caras Galadhon at evening."
  },
  "1/23": {
    "3019": "Gandalf pursues the Balrog to the peak of Zirak-zigil."
  },
  "1/25": {
    "3019": "He casts down the Balrog, and passes away. His body lies on the peak."
  },
  "2/14": {
    "3019": "The Mirror of Galadriel. Gandalf returns to life, and lies in a trance."
  },
  "2/16": {
    "3019": "Farewell to Lórien. Gollum in hiding on the west bank observes the departure."
  },
  "2/17": {
    "3019": "Gwaihir bears Gandalf to Lórien."
  },
  "2/23": {
    "3019": "The boats are attacked at night near Sam Gebir."
  },
  "2/25": {
    "3019": "The Company pass the Argonath and camp at Parth Galen. First Battle of the Fords of Isen; Théodred son of Théoden slain."
  },
  "2/26": {
    "3019": "Breaking of the Fellowship. Death of Boromir; his hom is heard in Minas Tirith. Meriadoc and Peregrin captured. Frodo and Samwise enter the eastern Emyn Muil. Aragorn sets out in pursuit of the Orcs at evening. Éomer hears of the descent of the Orc-band from the Emyn Muil."
  },
  "2/27": {
    "3019": "Aragorn reaches the west-cliff at sunrise. Éomer against Théoden's orders sets out from Eastfold about midnight to pursue the Orcs."
  },
  "2/28": {
    "3019": "Éomer overtakes the Orcs just outside Fangorn Forest."
  },
  "2/29": {
    "3019": "Meriadoc and Pippin escape and meet Treebeard. The Rohirrim attack at sunrise and destroy the Orcs. Frodo descends from the Emyn Muil and meets Gollum. Faramir sees the funeral boat of Boromir."
  },
  "2/30": {
    "3019": "Entmoot begins. Éomer returning to Edoras meets Aragorn."
  },
  "3/1": {
    "3019": "Frodo begins the passage of the Dead Marshes at dawn. Entmoot continues. Aragorn meets Gandalf the White. They set out for Edoras. Faramir leaves Minas Tirith on an errand to Ithilien."
  },
  "3/2": {
    "3019": "Frodo comes to the end of the Marshes. Gandalf comes to Edoras and heals Théoden. The Rohirrim ride west against Saruman. Second Battle of Fords of Isen. Erkenbrand defeated. Entmoot ends in after-noon. The Ents march on Isengard and reach it at night."
  },
  "3/3": {
    "3019": "Théoden retreats to Helm's Deep. Battle of the Horn-burg begins. Ents complete the destruction of Isengard."
  },
  "3/4": {
    "3019": "Théoden and Gandalf set out from Helm's Deep for Isengard. Frodo reaches the slag-mounds on the edge of the Desolation of the Morannon."
  },
  "3/5": {
    "3019": "Théoden reaches Isengard at noon. Parley with Saruman in Orthanc. Winged Nazgûl passes over the camp at Dol Baran. Gandalf sets out with Peregrin for Minas Tirith. Frodo hides in sight of the Morannon, and leaves at dusk."
  },
  "3/6": {
    "3019": "Aragorn overtaken by the Dúnedain in the early hours. Théoden sets out from the Hornburg for Harrowdale. Aragorn sets out later."
  },
  "3/7": {
    "3019": "Frodo taken by Faramir to Henneth Annûn. Aragorn comes to Dunharrow at nightfall."
  },
  "3/8": {
    "3019": "Aragorn takes the 'Paths of the Dead' at daybreak; he reaches Erech at midnight. Frodo leaves Henneth Annûn."
  },
  "3/9": {
    "3019": "Gandalf reaches Minas Tirith. Faramir leaves Henneth Annûn. Aragorn sets out from Erech and comes to Calembel. At dusk Frodo reaches the Morgul-road. Théoden comes to Dunharrow. Darkness begins to flow out of Mordor."
  },
  "3/10": {
    "3019": "The Dawnless Day. The Muster of Rohan: the Rohirrim ride from Harrowdale. Faramir rescued by Gandalf outside the gates of the City. Aragorn crosses Ringló. An army from the Morannon takes Cair Andros and passes into Anórien. Frodo passes the Cross-roads, and sees the Morgul-host set forth."
  },
  "3/11": {
    "3019": "Gollum visits Shelob, but seeing Frodo asleep nearly repents. Denethor sends Faramir to Osgiliath. Aragorn reaches Linhir and crosses into Lebennin. Eastern Rohan is invaded from the north. First assault on Lórien."
  },
  "3/12": {
    "3019": "Gollum leads Frodo into Shelob's lair. Faramir retreats to the Causeway Forts. Théoden camps under Minrimmon. Aragorn drives the enemy towards Pelargir. The Ents defeat the invaders of Rohan."
  },
  "3/13": {
    "3019": "Frodo captured by the Orcs of Cirith Ungol. The Pelennor is over-run. Faramir is wounded. Aragorn reaches Pelargir and captures the fleet. Théoden in Drúadan Forest.",
    "3020": "Frodo is taken ill (on the anniversary of his poisoning by Shelob).",
    "3021": "Frodo is again ill."
  },
  "3/14": {
    "3019": "Samwise finds Frodo in the Tower. Minas Tirith is besieged. The Rohirrim led by the Wild Men come to the Grey Wood."
  },
  "3/15": {
    "3019": "In the early hours the Witch-king breaks the Gates of the City. Denethor burns himself on a pyre. The horns of the Rohirrim are heard at cockcrow. Battle of the Pelennor. Théoden is slain. Aragorn raises the standard of Arwen. Frodo and Samwise escape and begin their journey north along the Morgai. Battle under the trees in Mirkwood; Thranduil repels the forces of Dol Guldur. Second assault on Lórien."
  },
  "3/16": {
    "3019": "Debate of the commanders. Frodo from the Morgai looks out over the camp to Mount Doom."
  },
  "3/17": {
    "3019": "Battle of Dale. King Brand and King Dáin Ironfoot fall. Many Dwarves and Men take refuge in Erebor and are besieged. Shagrat brings Frodo's cloak, mail-shirt, and sword to Barad-dûr."
  },
  "3/18": {
    "3019": "The Host of the West marches from Minas Tirith. Frodo comes in sight of the Isenmouthe; he is over-taken by Orcs on the road from Durthang to Udûn."
  },
  "3/19": {
    "3019": "The Host comes to Morgul-vale. Frodo and Samwise escape and begin their journey along the road to the Barad-dûr."
  },
  "3/22": {
    "3019": "The dreadful nightfall. Frodo and Samwise leave the road and turn south to Mount Doom. Third assault on Lórien."
  },
  "3/23": {
    "3019": "The Host passes out of Ithilien. Aragorn dismisses the faint-hearted. Frodo and Samwise cast away their arms and gear."
  },
  "3/24": {
    "3019": "Frodo and Samwise make their last journey to the feet of Mount Doom. The Host camps in the Desolation of the Morannon."
  },
  "3/25": {
    "3019": "The Host is surrounded on the Slag-hills. Frodo and Samwise reach the Sammath Naur. Gollum seizes the Ring and falls in the Cracks of Doom. Downfall of Barad-dûr and passing of Sauron.",
    "3021": "Birth of Elanor the Fair, daughter of Samwise. On this day the Fourth Age began in the reckoning of Gondor."
  },
  "3/27": {
    "3019": "Bard II and Thorin III Stonehelm drive the enemy from Dale."
  },
  "3/28": {
    "3019": "Celeborn crosses Anduin; destruction of Dol Guldur begun."
  },
  "4/6": {
    "3019": "Meeting of Celeborn and Thranduil.",
    "3020": "The mallorn flowers in the Party Field."
  },
  "4/8": {
    "3019": "The Ring-bearers are honoured on the Field of Cormallen."
  },
  "4/12": {
    "3018": "Gandalf reaches Hobbiton."
  },
  "5/1": {
    "3019": "Crowning of King Elessar; Elrond and Arwen set out from Rivendell.",
    "3020": "Samwise marries Rose."
  },
  "5/8": {
    "3019": "Éomer and Éowyn depart for Rohan with the sons of Elrond."
  },
  "5/20": {
    "3019": "Elrond and Arwen come to Lórien."
  },
  "5/27": {
    "3019": "The escort of Arwen leaves Lórien."
  },
  "6/14": {
    "3019": "The sons of Elrond meet the escort and bring Arwen to Edoras."
  },
  "6/16": {
    "3019": "They set out for Gondor."
  },
  "6/20": {
    "3018": "Sauron attacks Osgiliath. About the same time Thranduil is attacked, and Gollum escapes."
  },
  "6/25": {
    "3019": "King Elessar finds the sapling of the White Tree."
  },
  "7/1": {
    "3019": "Lithe. Arwen comes to the City."
  },
  "7/4": {
    "3018": "Boromir sets out from Minas Tirith."
  },
  "7/10": {
    "3018": "Gandalf imprisoned in Orthanc."
  },
  "7/15": {
    "3019": "Wedding of Elessar and Arwen.",
    "3020": "Frodo resigns office of mayor. and Will Whitfoot is restored."
  },
  "7/18": {
    "3019": "Éomer returns to Minas Tirith."
  },
  "7/19": {
    "3019": "The funeral escort of King Théoden sets out."
  },
  "8/1": {
    "3018": "All trace of Gollum is lost. It is thought that at about this time, being hunted both by the Elves and Sauron's servants, he took refuge in Moria; but when he had at last discovered the way to the West-gate he could not get out"
  },
  "8/7": {
    "3019": "The escort comes to Edoras. Funeral of King Théoden."
  },
  "8/14": {
    "3019": "The guests take leave of King Éomer."
  },
  "8/18": {
    "3019": "They come to Helm's Deep."
  },
  "8/22": {
    "3019": "They come to Isengard; they take leave of the King of the West at sunset."
  },
  "8/28": {
    "3019": "They overtake Saruman; Saruman turns towards the Shire."
  },
  "9/6": {
    "3019": "They halt in sight of the Mountains of Moria."
  },
  "9/13": {
    "3019": "Celeborn and Galadriel depart, the others set out for Rivendell."
  },
  "9/18": {
    "3018": "Gandalf escapes from Orthanc in the early hours. The Black Riders cross the Fords of Isen."
  },
  "9/19": {
    "3018": "Gandalf comes to Edoras as a beggar, and is refused admittance."
  },
  "9/20": {
    "3018": "Gandalf gains entrance to Edoras. Théoden commands him to go: 'Take any horse, only be gone ere tomorrow is old!'"
  },
  "9/21": {
    "3018": "Gandalf meets Shadowfax, but the horse will not allow him to come near. He follows Shadowfax far over the fields.",
    "3019": "They return to Rivendell.",
    "3021": "Frodo and Samwise set out from Hobbiton."
  },
  "9/22": {
    "3018": "The Black Riders reach Sarn Ford at evening; they drive off the guard of Rangers. Gandalf overtakes Shadowfax.",
    "3019": "The hundred and twenty-ninth birthday of Bilbo. Saruman comes to the Shire.",
    "3020": "Bilbo's hundred and thirtieth birthday.",
    "3021": "They meet the Last Riding of the Keepers of the Rings in Woody End."
  },
  "9/23": {
    "3018": "Four Riders enter the Shire before dawn. The others pursue the Rangers eastward, and then return to watch the Greenway. A Black Rider comes to Hobbiton at nightfall. Frodo leaves Bag End. Gandalf having tamed Shadowfax rides from Rohan."
  },
  "9/24": {
    "3018": "Gandalf crosses the Isen."
  },
  "9/26": {
    "3018": "The Old Forest. Frodo comes to Bombadil."
  },
  "9/27": {
    "3018": "Gandalf crosses Greyflood. Second night with Bombadil."
  },
  "9/28": {
    "3018": "The Hobbits captured by a Barrow-wight. Gandalf reaches Sarn Ford."
  },
  "9/29": {
    "3018": "Frodo reaches Bree at night. Gandalf visits the Gaffer.",
    "3021": "They come to the Grey Havens. Frodo and Bilbo depart over Sea with the Three Keepers. The end of the Third Age."
  },
  "9/30": {
    "3018": "Crickhollow and the Inn at Bree are raided in the early hours. Frodo leaves Bree. Gandalf comes to Crickhollow, and reaches Bree at night"
  },
  "10/1": {
    "3018": "Gandalf leaves Bree."
  },
  "10/3": {
    "3018": "He is attacked at night on Weathertop."
  },
  "10/5": {
    "3019": "Gandalf and the Hobbits leave Rivendell."
  },
  "10/6": {
    "3018": "The camp under Weathertop attacked at night Frodo wounded.",
    "3019": "They cross the Ford of Bruinen; Frodo feels the first return of pain.",
    "3020": "Frodo is again ill.",
    "3021": "Samwise returns to Bag End"
  },
  "10/9": {
    "3018": "Glorfindel leaves Rivendell."
  },
  "10/11": {
    "3018": "He drives the Riders off the Bridge of Mitheithel."
  },
  "10/13": {
    "3018": "Frodo crosses the Bridge."
  },
  "10/18": {
    "3018": "Glorfindel finds Frodo at dusk. Gandalf reaches Rivendell."
  },
  "10/20": {
    "3018": "Escape across the Ford of Bruinen."
  },
  "10/24": {
    "3018": "Frodo recovers and wakes. Boromir arrives in Rivendell at night"
  },
  "10/25": {
    "3018": "Council of Elrond."
  },
  "10/28": {
    "3019": "They reach Bree at nightfall."
  },
  "10/30": {
    "3019": "They leave Bree. The Travellers' come to the Brandywine Bridge at dark."
  },
  "11/1": {
    "3019": "They are arrested at Frogmorton."
  },
  "11/2": {
    "3019": "They come to Bywater and rouse the Shire-folk."
  },
  "11/3": {
    "3019": "Battle of Bywater, and Passing of Saruman. End of the War of the Ring."
  },
  "12/25": {
    "3018": "The Company of the Ring leaves Rivendell at dusk."
  }
}
