[
  {
    "quote": "It's the job that's never started as takes longest to finish.",
    "speaker": "Sam Gamgee"
  },
  {
    "quote": "But in the end it's only a passing thing, this shadow; even darkness must pass.",
    "speaker": "Sam Gamgee"
  },
  {
    "quote": "It is not the strength of the body, but the strength of the spirit.",
    "speaker": "J.R.R. Tolkien"
  },
  {
    "quote": "It is useless to meet revenge with revenge: it will heal nothing.",
    "speaker": "Frodo Baggins"
  },
  {
    "quote": "Deeds will not be less valiant because they are unpraised.",
    "speaker": "Aragorn"
  },
  {
    "quote": "Even the smallest person can change the course of history.",
    "speaker": "Lady Galadriel"
  },
  {
    "quote": "There's some good in this world, Mr. Frodo… and it's worth fighting for.",
    "speaker": "Sam Gamgee"
  },
  {
    "quote": "A hunted man sometimes wearies of distrust and longs for friendship.",
    "speaker": "Aragorn"
  },
  {
    "quote": "Yet such is oft the course of deeds that move the wheels of the world: small hands do them because they must, while the eyes of the great are elsewhere.",
    "speaker": "Elrond"
  },
  {
    "quote": "It is a strange fate that we should suffer so much fear and doubt over so small a thing… such a little thing.",
    "speaker": "Boromir"
  },
  {
    "quote": "He that breaks a thing to find out what it is, has left the path of wisdom.",
    "speaker": "Gandalf"
  },
  {
    "quote": "All we have to decide is what to do with the time that is given us.",
    "speaker": "Gandalf"
  },
  {
    "quote": "Many that live deserve death. And some that die deserve life. Can you give it to them? Then do not be eager to deal out death in judgement. For even the very wise cannot see all ends.",
    "speaker": "Gandalf"
  },
  {
    "quote": "It is not our part to master all the tides of the world, but to do what is in us for the succor of those years wherein we are set, uprooting the evil in the fields that we know, so that those who live after may have clean earth to till.",
    "speaker": "Gandalf"
  },
  {
    "quote": "Many are the strange chances of the world, and help oft shall come from the hands of the weak when the wise falter.",
    "speaker": "Gandalf"
  },
  {
    "quote": "The burned hand teaches best. After that advice about fire goes to the heart.",
    "speaker": "Gandalf"
  },
  {
    "quote": "Faithless is he that says farewell when the road darkens.",
    "speaker": "Gimli"
  },
  {
    "quote": "Torment in the dark was the danger that I feared, and it did not hold me back.",
    "speaker": "Gimli"
  },
  {
    "quote": "Who knows? Have patience. Go where you must go, and hope!",
    "speaker": "Gandalf"
  },
  {
    "quote": "It is not despair, for despair is only for those who see the end beyond all doubt. We do not!",
    "speaker": "Gandalf"
  },
  {
    "quote": "Maybe the paths that you each shall tread are already laid before your feet, though you do not see them.",
    "speaker": "Lady Galadriel"
  },
  {
    "quote": "Memory is not what the heart desires. That is only a mirror.",
    "speaker": "Gimli"
  },
  {
    "quote": "A day may come when the courage of men fails, when we forsake our friends and break all bonds of fellowship, but it is not this day.",
    "speaker": "Aragorn"
  },
  {
    "quote": "That there's some good in this world, Mr. Frodo… and it's worth fighting for.",
    "speaker": "Sam Gamgee"
  },
  {
    "quote": "I'm glad to be with you, Samwise Gamgee…here at the end of all things.",
    "speaker": "Frodo Baggins"
  },
  {
    "quote": "Sworn word may strengthen quaking heart.",
    "speaker": "Gimli"
  },
  {
    "quote": "Here at last, on the shores of the sea … comes the end of our Fellowship. I will not say do not weep, for not all tears are an evil.",
    "speaker": "Gandalf"
  },
  {
    "quote": "The mightiest man may be slain by one arrow.",
    "speaker": "Pippin"
  },
  {
    "quote": "There's some good in this world, Mr. Frodo… and it's worth fighting for.",
    "speaker": "Sam Gamgee"
  },
  {
    "quote": "The burned hand teaches best. After that advice about fire goes to the heart.",
    "speaker": "Gandalf"
  },
  {
    "quote": "Many that live deserve death. And some that die deserve life. Can you give it to them? Then do not be eager to deal out death in judgement. For even the very wise cannot see all ends.",
    "speaker": "Gandalf"
  },
  {
    "quote": "The praise of the praiseworthy is above all rewards.",
    "speaker": "Faramir"
  },
  {
    "quote": "A wizard is never late, Frodo Baggins. Nor is he early. He arrives precisely when he means to.",
    "speaker": "Gandalf"
  },
  {
    "quote": "Often does hatred hurt itself!",
    "speaker": "Gandalf"
  },
  {
    "quote": "Three hundred lives of men I have walked this earth and now I have no time.",
    "speaker": "Gandalf"
  },
  {
    "quote": "Nobody tosses a Dwarf!",
    "speaker": "Gimli"
  },
  {
    "quote": "I made a promise, Mr Frodo. A promise. \"Don't you leave him Samwise Gamgee.\" And I don't mean to. I don't mean to.",
    "speaker": "Sam Gamgee"
  },
  {
    "quote": "And to that I hold. I would rather share one lifetime with you than face all the ages of this world alone.",
    "speaker": "Arwen"
  },
  {
    "quote": "If more of us valued food and cheer and song above hoarded gold, it would be a merrier world.",
    "speaker": "Thorin Oakenshield"
  },
  {
    "quote": "Not all those who wander are lost.",
    "speaker": "J.R.R. Tolkien"
  },
  {
    "quote": "It’s a dangerous business, Frodo, going out your door. You step onto the road, and if you don’t keep your feet, there’s no knowing where you might be swept off to.",
    "speaker": "Bilbo Baggins"
  },
  {
    "quote": "The world is indeed full of peril, and in it there are many dark places; but still there is much that is fair, and though in all lands love is now mingled with grief, it grows perhaps the greater.",
    "speaker": "Haldir"
  },
  {
    "quote": "Folk seem to have been just landed in adventures, usually — their paths were laid that way. But I expect they had lots of chances, like us, of turning back, only they didn’t. And if they had, we shouldn’t know, because they’d have been forgotten.",
    "speaker": "Samwise Gamgee"
  },
  {
    "quote": "Don’t adventures ever have an end? I suppose not. Someone else always has to carry on the story.",
    "speaker": "Bilbo Baggins"
  }
]
